Repository: inveniosoftware/invenio-userprofiles
Catalog: invenio_userprofiles/translations/*/LC_MESSAGES/messages.po
Languages: ar, et, hu, sk, uk

source: %(icon)s Profile
ar: %(icon)sالملف الشّخصي
et: %(icon)s Profiil
hu: %(icon)s Profil
sk: %(icon)s Profil
uk: %(icon)s Профіль

source: Username
ar: اسم المستخدم
et: Kasutajanimi
hu: Felhasználónév
sk: Používateľské meno
uk: Назва облікового запису

source: Required. %(username_rules)s
ar: ضروري. %(username_rules)s
et: Nõutud. %(username_rules)s
hu: Kötelező. %(username_rules)s
sk: Povinné. %(username_rules)s
uk: Обов'язкове. %(username_rules)s

source: Username not provided.
ar: لم تدخل إسم مستخدم
et: Puudub kasutajanimi.
hu: Felhasználónév nincs megadva.
sk: Používateľské meno nebolo zadané.
uk: Не вкзано назву облікового запису

source: Full name
ar: الإسم الكامل
et: Ees- ja perekonnanimi
hu: Teljes név
sk: Celé meno
uk: Повне ім'я

source: Affiliations
ar: الانتماءات
et: Seosed
hu: Affiliációk
sk: Afiliácie
uk: Приналежності

source: Username is not available.
ar: إسم المستخدم غير موجود.
et: Kasutajanimi pole saadaval.
hu: A felhasználónév nem elérhető.
uk: Ця назва облікового запису недоступна.

source: Email address
ar: عنوان البريد الإلكتروني
et: E-posti aadress
hu: Email cím
sk: E-mailová adresa
uk: Електронна пошта

source: Re-enter email address
ar: أعد كتابة عنوان البريد الإلكتروني
et: Sisestage e-posti aadress uuesti
hu: Adja meg újra az email címét
sk: Znovu zadajte e-mailovú adresu
uk: Електронна пошта - ще раз.

source: Please re-enter your email address.
ar: أعد كتابة عنوان بريدك الإلكتروني، من فضلك.
et: Palun sisestade oma e-posti aadress uuesti
hu: Kérjük, adja meg újra az email címét!
sk: Prosím, znovu zadajte vašu e-mailovú adresu.
uk: Будь ласка, вкажіть ще раз адресу вашої електронної пошти.

source: Email addresses do not match.
ar: عناوين البريد الإلكتروني غير متطابقة.
et: Sisestatud e-posti aadressid on erinevad.
hu: Az email címek nem egyeznek meg.
sk: E-mailové adresy sa nezhodujú.
uk: Адреси електронної пошти не співпадають.

source: Resend verification email
ar: أعد إرسال بريد التثبّت
et: Saada kinnitusmeil uuesti
hu: Visszaigazoló email újraküldése
sk: Znovu odoslať overovací e-mail
uk: Повторно надіслати лист для підтвердження.

source: Profile visibility
ar: مرئيّة الملف الشخصي
et: Profiili nähtavus
hu: Profil láthatósága
uk: Видимість профілю

source: Public
ar: مشاع
et: Avalik
hu: Nyilvános
sk: Verejný
uk: Публічний

source: Hidden
ar: مخفي
et: Varjatud
hu: Elrejtve
uk: Прихований

source: Public profiles can be found by other users via searches on username, full name and affiliation. Hidden profiles cannot be found by other users.
ar: الملفات الشخصية العامة يمكن البحث عنها من قبل المستخدمين الآخرين عن طريق اسم المستخدم و الاسم الكامل و الانتماءات. الملفات الشّخصية الخفية لا يمكن إيجادها من قبل بقية المستخدمين.
et: Avalikke profiile saavad teised kasutajad otsida kasutajanime, kasutaja täisnime ja seoste järgi. Varjatud profiilid ei ole teistele kasutajatele leitavad.
hu: A nyilvános profilok megtalálhatók a keresőben felhasználónév, teljes név és affiliáció alapján. A rejtett profilok nem kereshetők más felhasználók számára.
uk: Публічні профілі можуть бути знайдені іншими користувачами пошуком за назвою олікового запису, повним ім'ям, чи приналежністю. Приховані профілі не бузе знайдено іншими користувачами.

source: Email visibility
ar: مرئيّة عنوان البريد الالكتروني
et: E-posti aadressi nähtavus
hu: Email láthatósága
uk: Видимість електронної адреси

source: Public email visibility enables your profile to be found by your email address.
ar: تتيح مرئية عنوان البريد الإلكتروني للعامة إمكانية إيجاد ملف حسابك الشخصي عبر بريدك الإلكتروني.
et: Avalik e-post võimaldab teistel otsida ja leida sinu profiili sinu e-posti aadressi järgi.
hu: A nyilvánosan látható email lehetővé teszi, hogy email cím alapján megtalálják az Ön profilját.
uk: Публічна видимість електронної адреси дозоляє знайти ваш профіль за адресою електронної пошти.

source: Preferences locale
hu: Nyelvi beállítások

source: Username must start with a letter, be at least three characters long and only contain alphanumeric characters, dashes and underscores.
ar: إسم المستخدم يتكون من ثلاثة حروف على الأقل. يجب ان يبدأ بحرف هجائي. و تستعمل فيه الحروف الهجائية، الأرقم و الشّرطات القصيرة و الطويلة.
et: Kasutajanimi peab algama tähega, olema vähemalt kolm tähemärki pikk ning võib sisaldada ainult tähti, numbreid, mõttekriipse ja allkriipse.
hu: A felhasználónévnek egy betűvel kell kezdődnie, legalább három karakter hosszúnak kell lennie, és csak alfanumerikus karaktereket, kötőjeleket és alulvonásokat tartalmazhat.
sk: Používateľské meno musí začínať písmenom, mať dĺžku najmenej tri znaky a môže obsahovať len alfanumerické znaky, pomlčky a podčiarknutia.
uk: Назва облікового запису повинна починатись з літери, містити не менше трьох символів, та містити лише літери латинського алфавіту, цифри, знаки дефісу та підкреслення.

source: Verification email sent.
ar: تمّ إرسال بريد التثبّت.
et: Kinnitusmeil on saadetud.
hu: Elküldtük a visszaigazoló emailt.
sk: Overovací e-mail bol odoslaný
uk: Листа для підтвердження надіслано.

source: Profile was updated. We have sent a verification email to %(email)s. Please check it.
ar: وقع تحديث الملف الشّخصي. أرسلنا بريدا للتّثبّت إلى %(email)s. فالرجاء التّأكّد.
et: Profiil on uuendatud. Kinnitusmeil on saadetud aadressile %(email)s, palun kontrolli seda.
hu: A profilt frissítettük. Küldtünk egy megerősítő emailt a(z) %(email)s címre. Kérjük, ellenőrizze!
sk: Profil bol aktualizovaný. Odoslali sme overovací e-mail na adresu %(email)s. Prosím, prečítajte si ho.
uk: Профіль оновлено. Ми надіслали листа для підтвердження до %(email)s. Будь ласка, перегляньте його.

source: Profile was updated.
ar: وقع تحديث الملف الشّخصي
et: Profiil on uuendatud.
hu: A profilt frissítettük.
sk: Profil bol aktualizovaný.
uk: Профіль оновлено.

source: Preferences were updated.
ar: تم تحيين الإعدادات.
et: Sinu eelistused on uuendatud.
hu: A beállításokat frissítettük.
uk: Налаштування оновлено.

source: Profile
ar: الملف الشّخصي
et: Profiil
hu: Profil
sk: Profil
uk: Профіль

source: You have not yet verified your email address.
ar: لم تتثبّت بعد من عنوان بريدك الإلكتروني.
et: Sa ei ole veel oma e-posti aadressi kinnitanud.
hu: Ön még nem erősítette meg az email címét.
sk: Zatiaľ ste nedokončili overenie vašej e-mailovej adresy.
uk: Ви ще не підтвердили адреси вашої електронної пошти.

source: Cancel
ar: إلغاء
et: Tühista
hu: Mégsem
sk: Zrušiť
uk: Скасувати

source: Update profile
ar: تحديث الملف الشّخصي
et: Uuenda profiili
hu: Profil frissítése
sk: Aktualizovať profil
uk: Оновити профіль

source: Preferences
ar: الإعدادات
et: Eelistused
hu: Preferenciák
uk: Налаштування

source: Update preferences
ar: تحيين الإعدادات
et: Uuenda eelistusi
hu: Preferenciák frissítése
uk: Оновити налаштування
